[
  {
    "id": 1,
    "bookName": "Harry Potter and the Sorcerer's Stone",
    "author": "J.K. Rowling",
    "image": "https://i.ibb.co/Q6QVck5/hp1.jpg",
    "review": "Harry Potter and the Sorcerer's Stone is the enchanting start of the globally beloved series by J.K. Rowling. The book introduces young Harry Potter, who discovers on his eleventh birthday that he is a wizard. Attending Hogwarts School of Witchcraft and Wizardry, Harry makes lifelong friends and uncovers the secrets of his past. With magical adventures and intriguing mysteries, this book captures the imagination and sets the stage for an epic saga.",
    "totalPages": 309,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Magic", "Adventure"],
    "publisher": "Bloomsbury (UK), Scholastic (US)",
    "yearOfPublishing": 1997
  },
  {
    "id": 2,
    "bookName": "The Godfather",
    "author": "Mario Puzo",
    "image": "https://i.ibb.co/VCpv7V5/godfather.jpg",
    "review": "The Godfather is a gripping tale of crime and family dynamics. Written by Mario Puzo, this classic novel delves into the life of the Corleone crime family, led by the powerful Vito Corleone. Set against the backdrop of mid-20th century America, the story explores themes of loyalty, power, and revenge. With its complex characters and intense narrative, The Godfather offers a compelling look at the dark underbelly of organized crime and the sacrifices made for family and honor.",
    "totalPages": 448,
    "rating": 4.8,
    "category": "Crime",
    "tags": ["Mafia", "Family Saga"],
    "publisher": "G.P. Putnam's Sons",
    "yearOfPublishing": 1969
  },
  {
    "id": 3,
    "bookName": "A Game of Thrones",
    "author": "George R.R. Martin",
    "image": "https://i.ibb.co/5nMZQM4/got1.jpg",
    "review": "A Game of Thrones is the first book in George R.R. Martin's epic fantasy series 'A Song of Ice and Fire'. It introduces readers to the Seven Kingdoms of Westeros, where noble families vie for control of the Iron Throne. With its complex characters, intricate plots, and vivid world-building, this novel sets the stage for a grand saga of power, betrayal, and survival. Martin's storytelling is gripping, filled with unexpected twists and a rich tapestry of interwoven tales.",
    "totalPages": 694,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Epic Fantasy", "Political Intrigue"],
    "publisher": "Bantam Spectra",
    "yearOfPublishing": 1996
  },
  {
    "id": 4,
    "bookName": "The Return of the King",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/NZpSBxT/lor1.png",
    "review": "The Return of the King is the final volume of J.R.R. Tolkien's 'The Lord of the Rings'. The epic conclusion follows the final battles for Middle-earth and the culmination of Frodo's quest to destroy the One Ring. With the stakes higher than ever, the characters face their greatest trials. Tolkien's masterful storytelling and rich, immersive world-building deliver a satisfying and memorable conclusion to this timeless trilogy.",
    "totalPages": 416,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Epic Fantasy", "Adventure"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1955
  },
  {
    "id": 5,
    "bookName": "Divergent",
    "author": "Veronica Roth",
    "image": "https://i.ibb.co/jvQnwKq/Divergent.jpg",
    "review": "Modern bound books were preceded by many other written mediums, such as the codex and the scroll. ",
    "totalPages": 407,
    "rating": 4.03,
    "category": "Fiction",
    "tags": ["Romance", "Dystopia"],
    "publisher": "Katherine Tegen Books",
    "yearOfPublishing": 2002
  },
  {
    "id": 6,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/xfpG4pP/4573132.jpg",
    "review": "To Kill a Mockingbird is a masterpiece that tackles complex themes such as racial injustice, moral growth, and the loss of innocence. Set in the racially-charged atmosphere of 1930s Alabama, Harper Lee's novel follows young Scout Finch as she witnesses her father, Atticus Finch, defend an innocent black man accused of raping a white woman. Through Scout's eyes, readers confront the harsh realities of bigotry and prejudice, while also discovering the enduring power of empathy and compassion.",
    "totalPages": 336,
    "rating": 4.5,
    "category": "Classic",
    "tags": ["Social Justice", "Southern Gothic"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "id": 7,
    "bookName": "Clockwork Angel",
    "author": "Cassandra Clare",
    "image": "https://i.ibb.co/HhvZ6gV/Clockwork-Angel.jpg",
    "review": "This book was fantastic! I am happy that I read it after TMI because I was able to catch the nods to those books. I love both Jem and Will and all of the other characters.",
    "totalPages": 439,
    "rating": 4.34,
    "category": "Fiction",
    "tags": ["Paranormal", "Steampunk"],
    "publisher": "Margaret K. McElderry",
    "yearOfPublishing": 2011
  },
  {
    "id": 8,
    "bookName": "Vampire Academy",
    "author": "Richelle Mead",
    "image": "https://i.ibb.co/Gtv2Hwg/VampAcad.jpg",
    "review": "A fun read. I had a good time with it. Honestly, I would have loved it had I read it when I bought the series as a teen, but that's on me.",
    "totalPages": 322,
    "rating": 4.11,
    "category": "Fiction",
    "tags": ["Urban Fantasy", "Vampire"],
    "publisher": "Razorbill",
    "yearOfPublishing": 2002
  },
  {
    "id": 9,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co/XsLq89K/6682261.jpg",
    "review": "1984 is a chilling dystopian novel that remains as relevant today as when it was first published. Set in a totalitarian society where individuality is suppressed and truth is manipulated by the ruling Party, George Orwell's masterpiece explores themes of surveillance, propaganda, and the erosion of freedom. Through the protagonist Winston Smith's rebellion against the oppressive regime, Orwell paints a stark warning about the dangers of unchecked government power and the importance of preserving civil liberties.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Science Fiction",
    "tags": ["Dystopian", "Political Allegory"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "id": 10,
    "bookName": "Artemis Fowl",
    "author": "Eoin Colfer",
    "image": "https://i.ibb.co/x7BPmvy/Artemis-Fowl.jpg",
    "review": " Ironically, it's the supernatural characters that follow familiar archetypes, while the humans are strange and atypical.",
    "totalPages": 306,
    "rating": 3.06,
    "category": "Drama",
    "tags": ["Fantasy", "Young Adult"],
    "publisher": "Mir Safe",
    "yearOfPublishing": 2006
  },
  {
    "id": 11,
    "bookName": "Lord of the Flies",
    "author": "William Golding",
    "image": "https://i.ibb.co/Bcrd1z3/Lord-Flies.jpg",
    "review": "Lord of the Flies is one of the most disturbing books I've ever read. It was required high school reading and since then, I've read it four more times. It is as disturbing now as it was then.",
    "totalPages": 172,
    "rating": 3.69,
    "category": "Fiction",
    "tags": ["Classics", "Dystopia"],
    "publisher": "Penguin Books",
    "yearOfPublishing": 1954
  },
  {
    "id": 12,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co/bdyjSvG/7497933.jpg",
    "review": "Pride and Prejudice is a timeless romance that captivates readers with its wit, charm, and unforgettable characters. Set in the English countryside during the early 19th century, Jane Austen's novel follows the spirited Elizabeth Bennet as she navigates the complexities of love, society, and class. Through Elizabeth's journey of self-discovery and her tumultuous relationship with the enigmatic Mr. Darcy, Austen crafts a story that celebrates the triumph of true love over prejudice and societal expectations.",
    "totalPages": 432,
    "rating": 4.4,
    "category": "Romance",
    "tags": ["Classic Literature", "Regency Era"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "id": 13,
    "bookName": "EveryOne",
    "author": "Nenson Mendela",
    "image": "https://i.ibb.co/vmYV9Rv/EverMore.jpg",
    "review": " A successful book overview provides readers with a well-rounded glimpse into the story's world and themes",
    "totalPages": 3201,
    "rating": 3.99,
    "category": "Science",
    "tags": ["Paranormal", "Fantasy"],
    "publisher": "St. Martin Jonas",
    "yearOfPublishing": 2009
  },
  {
    "id": 14,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co/F7yh26X/7926522.jpg",
    "review": "The Great Gatsby is a haunting portrayal of the American Dream and the emptiness that lies beneath its glittering facade. Set amidst the lavish parties and excesses of the Roaring Twenties, F. Scott Fitzgerald's novel follows the enigmatic Jay Gatsby as he pursues his elusive vision of love and success. Through the eyes of narrator Nick Carraway, readers are drawn into a world of illusion, obsession, and tragedy, where the pursuit of wealth and status ultimately leads to disillusionment and despair.",
    "totalPages": 180,
    "rating": 4.2,
    "category": "Literary Fiction",
    "tags": ["Jazz Age", "Tragic Romance"],
    "publisher": "Charles Scribner's Sons",
    "yearOfPublish": 1925
  },
  {
    "id": 15,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/1s31NZr/pexels-levent-simsek-4245048.jpg",
    "review": "The Hobbit is a timeless adventure that transports readers to the enchanting world of Middle-earth. Written by J.R.R. Tolkien, this beloved tale follows the journey of Bilbo Baggins, a hobbit who is reluctantly swept into a quest to reclaim the lost kingdom of Erebor from the dragon Smaug. Along the way, Bilbo encounters a colorful cast of characters, including dwarves, elves, and the mysterious wizard Gandalf. Filled with thrilling escapades, riddles, and epic battles, The Hobbit is a captivating story of courage, friendship, and the enduring power of home.",
    "totalPages": 310,
    "rating": 4.7,
    "category": "Fantasy",
    "tags": ["Adventure", "Epic Fantasy"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "id": 16,
    "bookName": "A Dance with Dragons",
    "author": "George R.R. Martin",
    "image": "https://i.ibb.co/Sr80Fw0/got2.jpg",
    "review": "A Dance with Dragons is the fifth book in George R.R. Martin's 'A Song of Ice and Fire' series. As the fate of the Seven Kingdoms hangs in the balance, new threats emerge from beyond the Wall and across the Narrow Sea. This installment weaves together multiple storylines, expanding the scope and depth of the series. Martin's narrative skill and world-building prowess shine through, delivering a tale of intrigue, danger, and epic scale.",
    "totalPages": 1016,
    "rating": 4.7,
    "category": "Fantasy",
    "tags": ["Epic Fantasy", "Adventure"],
    "publisher": "Bantam Spectra",
    "yearOfPublishing": 2011
  },
  {
    "id": 17,
    "bookName": "The Giver",
    "author": "Royel Roy",
    "image": "https://i.ibb.co/Rg7PMQ5/TheGiver.jpg",
    "review": "Royel Roy's book is a piece of propaganda, using oversimplification, emotional appeals, and dualistic morality to shut down her readers' minds. ",
    "totalPages": 330,
    "rating": 4.12,
    "category": "Fiction",
    "tags": ["Dystopia", "Children"],
    "publisher": "Marfine Haker",
    "yearOfPublishing": 1983
  },
  {
    "id": 18,
    "bookName": "Harry Potter and the Chamber of Secrets",
    "author": "J.K. Rowling",
    "image": "https://i.ibb.co/b5N0tgf/hp2.jpg",
    "review": "Harry Potter and the Chamber of Secrets is the thrilling second installment in J.K. Rowling's iconic series. As Harry returns to Hogwarts for his second year, he faces new dangers when the mysterious Chamber of Secrets is opened. With the help of his friends Hermione and Ron, Harry must uncover the dark forces at work and save the school from a deadly threat. This book deepens the lore and introduces new magical elements, keeping readers spellbound.",
    "totalPages": 341,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Magic", "Mystery"],
    "publisher": "Bloomsbury (UK), Scholastic (US)",
    "yearOfPublishing": 1998
  },
  {
    "id": 18,
    "bookName": "City Of Bones",
    "author": "Charli Chapline",
    "image": "https://i.ibb.co/BgYBjsZ/City-Of-Bones.jpg",
    "review": "medium for recording information in the form of writing or images. ",
    "totalPages": 310,
    "rating": 4.07,
    "category": "Fiction",
    "tags": ["Magic", "Demons"],
    "publisher": "Margaret K.",
    "yearOfPublishing": 2007
  },
  {
    "id": 19,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co/2MpXgr1/79002.jpg",
    "review": "The Catcher in the Rye is a timeless classic that explores the alienation and disillusionment of the teenage experience. Through the eyes of Holden Caulfield, Salinger delves into themes of identity, loss, and the struggle to find authenticity in a world filled with phoniness. Caulfield's poignant journey through the streets of New York City resonates with readers of all ages, offering a profound reflection on the challenges of growing up and finding one's place in society.",
    "totalPages": 224,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Coming-of-age", "Literary Fiction"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "id": 20,
    "bookName": "The Fault in Our Stars",
    "author": "Johan Grow",
    "image": "https://i.ibb.co/n84GJ4K/TFIOS.jpg",
    "review": "Books are typically composed of many pages, bound together and protected by a cover",
    "totalPages": 270,
    "rating": 4.14,
    "category": "Fiction",
    "tags": ["Contemporary", "Tragedy"],
    "publisher": "Lotous Books",
    "yearOfPublishing": 2005
  },
  {
    "id": 21,
    "bookName": "Harry Potter and the Prisoner of Azkaban",
    "author": "J.K. Rowling",
    "image": "https://i.ibb.co/2nsHvqw/hp3.jpg",
    "review": "Harry Potter and the Prisoner of Azkaban is a captivating third book in the Harry Potter series by J.K. Rowling. This time, Harry learns about the escaped prisoner Sirius Black, who is believed to be after him. With the discovery of new magical elements like the Marauder's Map and the introduction of Dementors, the story takes darker and more complex turns. Harry's journey becomes more perilous and exciting as he uncovers surprising truths about his past and family.",
    "totalPages": 435,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Magic", "Adventure"],
    "publisher": "Bloomsbury (UK), Scholastic (US)",
    "yearOfPublishing": 1999
  }

]
